# --- Daily-driver CLI ---
brew "bash"        # modern bash 5.x (macOS ships 3.2; needed by SDKMAN installer + most bash scripts)
brew "antidote"    # zsh plugin manager
brew "gh"          # GitHub CLI
brew "tig"         # git TUI
brew "lazygit"     # git TUI (richer than tig)
brew "git-delta"   # pretty diff pager (used by lazygit + git)
brew "neovim"      # editor
brew "tree-sitter" # incremental parser (neovim syntax/highlight)
brew "starship"    # shell prompt
brew "stow"        # symlink farm manager (bootstraps this repo)
brew "jq"          # JSON processor (used by claude statusline)
brew "fd"          # faster find
brew "ripgrep"     # faster grep
brew "fzf"         # fuzzy finder
brew "zoxide"      # smart cd

# --- Node toolchain ---
brew "fnm"         # Node version manager (reads .nvmrc / .node-version)
brew "pnpm"        # Node package manager (content-addressable store)

# --- Yazi + its preview/peek deps ---
brew "yazi"
brew "ffmpeg"      # video/audio preview
brew "sevenzip"    # archive preview (7zz)
brew "poppler"     # PDF preview
brew "imagemagick" # image preview
brew "resvg"       # SVG preview
brew "chafa"       # terminal image fallback (when KGP/Sixel probe fails)

# --- GUI ---
cask "ghostty"     # terminal emulator
cask "cmux"        # Ghostty-based GUI w/ AI-agent vertical tabs (reuses ghostty config)
cask "orbstack"    # Docker / k8s runtime (lightweight Docker Desktop replacement)
cask "rectangle"   # window snapping
cask "stats"       # menu-bar system monitor
cask "iina"        # video player (yazi opener for video/*)
